Revit 2024 API
ExtensibleStorageFilter.SchemaGuid Property
 Schema id used to filter elements with extensible storage data
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Guid SchemaGuid { get; }
Visual Basic
Public ReadOnly Property SchemaGuid As Guid
	Get
Visual C++
public:
property Guid SchemaGuid {
	Guid get ();
}
See Also
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace